Ran Plan for project: `platform` dir: `platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:77d9e42 

Terragrunt already installed: terragrunt version v0.96.1

Cleaning old generated .tf files...
✅ Cleanup complete

09:58:41.163 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
09:58:41.271 INFO   terraform1.11.0: Initializing the backend...
09:58:41.368 INFO   terraform1.11.0: 
09:58:41.368 INFO   terraform1.11.0: Successfully configured the backend "s3"! Terraform will automatically
09:58:41.368 INFO   terraform1.11.0: use this backend unless the backend configuration changes.
09:58:41.537 INFO   terraform1.11.0: Initializing provider plugins...
09:58:41.537 INFO   terraform1.11.0: - terraform.io/builtin/terraform is built in to Terraform
09:58:41.537 INFO   terraform1.11.0: - Reusing previous version of hashicorp/helm from the dependency lock file
09:58:41.578 INFO   terraform1.11.0: - Reusing previous version of hashicorp/null from the dependency lock file
09:58:41.589 INFO   terraform1.11.0: - Reusing previous version of alekc/kubectl from the dependency lock file
09:58:41.600 INFO   terraform1.11.0: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
09:58:41.614 INFO   terraform1.11.0: - Reusing previous version of hashicorp/vault from the dependency lock file
09:58:41.626 INFO   terraform1.11.0: - Reusing previous version of mastercard/restapi from the dependency lock file
09:58:41.636 INFO   terraform1.11.0: - Reusing previous version of hashicorp/time from the dependency lock file
09:58:41.647 INFO   terraform1.11.0: - Reusing previous version of hashicorp/http from the dependency lock file
09:58:41.657 INFO   terraform1.11.0: - Reusing previous version of hashicorp/random from the dependency lock file
09:58:41.668 INFO   terraform1.11.0: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
09:58:41.921 INFO   terraform1.11.0: - Installing hashicorp/helm v2.17.0...
09:58:42.884 INFO   terraform1.11.0: - Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
09:58:43.482 INFO   terraform1.11.0: - Installing alekc/kubectl v2.1.3...
09:58:44.657 INFO   terraform1.11.0: - Installed alekc/kubectl v2.1.3 (self-signed, key ID 772FB27A86DAFCE7)
09:58:45.247 INFO   terraform1.11.0: - Installing mastercard/restapi v1.20.0...
09:58:45.881 INFO   terraform1.11.0: - Installed mastercard/restapi v1.20.0 (self-signed, key ID DCB8C431D71C30AB)
09:58:45.937 INFO   terraform1.11.0: - Installing hashicorp/time v0.13.1...
09:58:46.269 INFO   terraform1.11.0: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
09:58:46.322 INFO   terraform1.11.0: - Installing hashicorp/kubernetes v2.38.0...
09:58:47.423 INFO   terraform1.11.0: - Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
09:58:47.485 INFO   terraform1.11.0: - Installing hashicorp/null v3.2.4...
09:58:47.972 INFO   terraform1.11.0: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
09:58:48.614 INFO   terraform1.11.0: - Installing cloudflare/cloudflare v4.52.5...
09:58:49.802 INFO   terraform1.11.0: - Installed cloudflare/cloudflare v4.52.5 (self-signed, key ID C76001609EE3B136)
09:58:49.882 INFO   terraform1.11.0: - Installing hashicorp/vault v4.8.0...
09:58:50.910 INFO   terraform1.11.0: - Installed hashicorp/vault v4.8.0 (signed by HashiCorp)
09:58:50.967 INFO   terraform1.11.0: - Installing hashicorp/http v3.5.0...
09:58:51.304 INFO   terraform1.11.0: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
09:58:51.363 INFO   terraform1.11.0: - Installing hashicorp/random v3.7.2...
09:58:51.700 INFO   terraform1.11.0: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
09:58:51.700 INFO   terraform1.11.0: Partner and community providers are signed by their developers.
09:58:51.700 INFO   terraform1.11.0: If you'd like to know more about provider signing, you can read about it here:
09:58:51.701 INFO   terraform1.11.0: https://www.terraform.io/docs/cli/plugins/signing.html
09:58:51.701 INFO   terraform1.11.0: Terraform has made some changes to the provider dependency selections recorded
09:58:51.701 INFO   terraform1.11.0: in the .terraform.lock.hcl file. Review those changes and commit them to your
09:58:51.701 INFO   terraform1.11.0: version control system if they represent changes you intended to make.
09:58:51.701 INFO   terraform1.11.0: Terraform has been successfully initialized!
09:58:51.701 INFO   terraform1.11.0: 
09:58:51.701 INFO   terraform1.11.0: You may now begin working with Terraform. Try running "terraform plan" to see
09:58:51.701 INFO   terraform1.11.0: any changes that are required for your infrastructure. All Terraform commands
09:58:51.701 INFO   terraform1.11.0: should now work.
09:58:51.701 INFO   terraform1.11.0: If you ever set or change modules or backend configuration for Terraform,
09:58:51.701 INFO   terraform1.11.0: rerun this command to reinitialize your working directory. If you forget, other
09:58:51.701 INFO   terraform1.11.0: commands will detect it and remind you to do so if necessary.
09:58:54.214 STDOUT terraform1.11.0: terraform_data.domain_config_check: Refreshing state... [id=28e073ad-b9b0-a028-2f69-65fbcddfbbb1]
09:58:54.215 STDOUT terraform1.11.0: terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
09:58:54.215 STDOUT terraform1.11.0: terraform_data.health_check_target[0]: Refreshing state... [id=ff153b72-191c-4599-018f-65a742e9eb4d]
09:58:54.221 STDOUT terraform1.11.0: data.cloudflare_zone.internal: Reading...
09:58:54.225 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Reading...
09:58:54.227 STDOUT terraform1.11.0: random_id.kubero_session_secret: Refreshing state... [id=zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc]
09:58:54.227 STDOUT terraform1.11.0: kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system]
09:58:54.227 STDOUT terraform1.11.0: random_id.kubero_webhook_secret: Refreshing state... [id=dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI]
09:58:54.227 STDOUT terraform1.11.0: random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
09:58:54.228 STDOUT terraform1.11.0: random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
09:58:54.230 STDOUT terraform1.11.0: random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
09:58:54.230 STDOUT terraform1.11.0: random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
09:58:54.230 STDOUT terraform1.11.0: random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
09:58:54.238 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
09:58:54.240 STDOUT terraform1.11.0: kubernetes_namespace.observability: Refreshing state... [id=observability]
09:58:54.253 STDOUT terraform1.11.0: data.vault_kv_secret_v2.signoz_clickhouse: Reading...
09:58:54.277 STDOUT terraform1.11.0: data.vault_kv_secret_v2.signoz_clickhouse: Read complete after 0s [id=secret/data/signoz]
09:58:54.314 STDOUT terraform1.11.0: vault_policy.vso_reader: Refreshing state... [id=vso-reader]
09:58:54.314 STDOUT terraform1.11.0: vault_policy.default: Refreshing state... [id=default]
09:58:54.316 STDOUT terraform1.11.0: vault_policy.admin[0]: Refreshing state... [id=admin]
09:58:54.317 STDOUT terraform1.11.0: vault_identity_group.admin[0]: Refreshing state... [id=0ac3b38e-52bb-3a86-d72d-71ad31784ee3]
09:58:54.318 STDOUT terraform1.11.0: vault_policy.kubero: Refreshing state... [id=kubero]
09:58:54.320 STDOUT terraform1.11.0: vault_identity_group.viewer[0]: Refreshing state... [id=89e06fbb-fc87-9471-ecc7-04b5747e4b06]
09:58:54.324 STDOUT terraform1.11.0: vault_policy.viewer[0]: Refreshing state... [id=viewer]
09:58:54.325 STDOUT terraform1.11.0: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
09:58:54.326 STDOUT terraform1.11.0: vault_identity_group.developer[0]: Refreshing state... [id=f7e4fa30-a522-c524-6927-6e0f8c21d4f3]
09:58:54.339 STDOUT terraform1.11.0: vault_policy.developer[0]: Refreshing state... [id=developer]
09:58:54.339 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Reading...
09:58:54.341 STDOUT terraform1.11.0: kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
09:58:54.344 STDOUT terraform1.11.0: kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
09:58:54.347 STDOUT terraform1.11.0: kubernetes_service.homer[0]: Refreshing state... [id=platform/homer]
09:58:54.347 STDOUT terraform1.11.0: helm_release.vault: Refreshing state... [id=vault]
09:58:54.348 STDOUT terraform1.11.0: kubernetes_config_map.homer_config[0]: Refreshing state... [id=platform/homer-config]
09:58:54.349 STDOUT terraform1.11.0: helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
09:58:54.352 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system/deployments/kubero-operator-controller-manager]
09:58:54.361 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
09:58:54.366 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Read complete after 0s [id=platform/casdoor-builtin-secret]
09:58:54.376 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
09:58:54.402 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
09:58:54.403 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
09:58:54.404 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
09:58:54.423 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
09:58:54.423 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
09:58:54.425 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/rolebindings/kubero-operator-leader-election-rolebinding]
09:58:54.426 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
09:58:54.476 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
09:58:54.480 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
09:58:54.480 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
09:58:54.503 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
09:58:54.503 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
09:58:54.508 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
09:58:54.534 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
09:58:54.544 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
09:58:54.545 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
09:58:54.554 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
09:58:54.554 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/services/kubero-operator-controller-manager-metrics-service]
09:58:54.583 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
09:58:54.583 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
09:58:54.605 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
09:58:54.618 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
09:58:54.622 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/roles/kubero-operator-leader-election-role]
09:58:54.625 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
09:58:54.629 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
09:58:54.635 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
09:58:54.639 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
09:58:54.647 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
09:58:54.698 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
09:58:54.700 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
09:58:54.701 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
09:58:54.708 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
09:58:54.713 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/configmaps/kubero-operator-manager-config]
09:58:54.724 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
09:58:54.727 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/serviceaccounts/kubero-operator-controller-manager]
09:58:54.730 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
09:58:54.735 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
09:58:54.737 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
09:58:54.740 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
09:58:54.779 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
09:58:54.805 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
09:58:54.808 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
09:58:54.819 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
09:58:54.820 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
09:58:54.821 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
09:58:54.825 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
09:58:54.827 STDOUT terraform1.11.0: kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
09:58:54.844 STDOUT terraform1.11.0: helm_release.signoz: Refreshing state... [id=signoz]
09:58:54.844 STDOUT terraform1.11.0: vault_policy.reader[0]: Refreshing state... [id=reader]
09:58:54.898 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_role.kubero: Refreshing state... [id=auth/kubernetes/role/kubero]
09:58:54.898 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/kubernetes/config]
09:58:54.954 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_role.vso: Refreshing state... [id=auth/kubernetes/role/vault-secrets-operator]
09:58:54.960 STDOUT terraform1.11.0: helm_release.casdoor[0]: Refreshing state... [id=casdoor]
09:58:54.963 STDOUT terraform1.11.0: kubernetes_namespace.kubero: Refreshing state... [id=kubero]
09:58:54.978 STDOUT terraform1.11.0: vault_mount.database: Refreshing state... [id=database]
09:58:54.978 STDOUT terraform1.11.0: vault_mount.kv: Refreshing state... [id=secret]
09:58:54.981 STDOUT terraform1.11.0: helm_release.vault_secrets_operator: Refreshing state... [id=vault-secrets-operator]
09:58:54.981 STDOUT terraform1.11.0: kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
09:58:54.992 STDOUT terraform1.11.0: kubernetes_service_account.kubero: Refreshing state... [id=kubero/kubero]
09:58:54.998 STDOUT terraform1.11.0: kubernetes_deployment.homer[0]: Refreshing state... [id=platform/homer]
09:58:55.000 STDOUT terraform1.11.0: vault_kv_secret_v2.kubero: Refreshing state... [id=secret/data/kubero]
09:58:55.020 STDOUT terraform1.11.0: kubernetes_secret.kubero_secrets: Refreshing state... [id=kubero/kubero-secrets]
09:58:55.021 STDOUT terraform1.11.0: kubectl_manifest.kubero_instance: Refreshing state... [id=/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero]
09:58:55.068 STDOUT terraform1.11.0: kubernetes_ingress_v1.homer[0]: Refreshing state... [id=platform/homer-ingress]
09:58:55.406 STDOUT terraform1.11.0: kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
09:58:55.407 STDOUT terraform1.11.0: kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
09:58:55.409 STDOUT terraform1.11.0: kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
09:58:55.436 STDOUT terraform1.11.0: kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
09:58:55.436 STDOUT terraform1.11.0: kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
09:58:55.628 STDOUT terraform1.11.0: data.cloudflare_zone.internal: Read complete after 2s [id=6e69310ba4000e47c0a2480e2606713a]
09:58:58.269 STDOUT terraform1.11.0: restapi_object.role_vault_developer[0]: Refreshing state... [id=vault-developer]
09:58:58.269 STDOUT terraform1.11.0: restapi_object.role_vault_viewer[0]: Refreshing state... [id=vault-viewer]
09:58:58.269 STDOUT terraform1.11.0: restapi_object.provider_github[0]: Refreshing state... [id=GitHub]
09:58:58.269 STDOUT terraform1.11.0: restapi_object.role_vault_admin[0]: Refreshing state... [id=vault-admin]
09:58:58.269 STDOUT terraform1.11.0: helm_release.portal_auth[0]: Refreshing state... [id=portal-auth]
09:58:58.340 STDOUT terraform1.11.0: restapi_object.app_portal_gate[0]: Refreshing state... [id=portal-gate]
09:58:58.340 STDOUT terraform1.11.0: restapi_object.app_kubero_oidc[0]: Refreshing state... [id=kubero-oidc]
09:58:58.342 STDOUT terraform1.11.0: restapi_object.app_dashboard_oidc[0]: Refreshing state... [id=dashboard-oidc]
09:58:58.343 STDOUT terraform1.11.0: restapi_object.app_vault_oidc[0]: Refreshing state... [id=vault-oidc]
09:58:58.407 STDOUT terraform1.11.0: time_sleep.wait_for_vso_crd: Refreshing state... [id=2025-12-23T10:52:00Z]
09:58:58.416 STDOUT terraform1.11.0: vault_jwt_auth_backend.oidc[0]: Refreshing state... [id=oidc]
09:58:58.431 STDOUT terraform1.11.0: vault_identity_group_alias.admin_namespaced[0]: Refreshing state... [id=42d8f3ab-032d-f865-ba54-d208a869507d]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.admin_builtin[0]: Refreshing state... [id=28b76979-be25-cda3-88e9-f6bef3933f0a]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.developer_namespaced[0]: Refreshing state... [id=52fb4fd2-68f1-523c-bb2c-94531fffbea5]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.viewer_simple[0]: Refreshing state... [id=a18ff631-972e-fb87-c8be-dfb4266d04d4]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.developer_builtin[0]: Refreshing state... [id=4b6147b5-3ee5-3bd4-3be2-5f2772d990f6]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.viewer_namespaced[0]: Refreshing state... [id=79ede045-2d91-e0ab-379b-efd8be497f21]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.developer_simple[0]: Refreshing state... [id=7ef34f02-fd5c-7edd-5929-dd62254c3660]
09:58:58.433 STDOUT terraform1.11.0: vault_identity_group_alias.admin_simple[0]: Refreshing state... [id=ab9f132d-89bb-08b4-4207-c4cb51e00d2f]
09:58:58.435 STDOUT terraform1.11.0: vault_jwt_auth_backend_role.reader[0]: Refreshing state... [id=auth/oidc/role/reader]
09:58:58.441 STDOUT terraform1.11.0: vault_jwt_auth_backend_role.default[0]: Refreshing state... [id=auth/oidc/role/default]
09:58:58.846 STDOUT terraform1.11.0: time_sleep.wait_for_portal_auth[0]: Refreshing state... [id=2025-12-19T09:58:42Z]
09:59:00.057 STDOUT terraform1.11.0: kubernetes_manifest.portal_auth_middleware_platform[0]: Refreshing state...
09:59:00.370 STDOUT terraform1.11.0: Terraform used the selected providers to generate the following execution
09:59:00.370 STDOUT terraform1.11.0: plan. Resource actions are indicated with the following symbols:
09:59:00.370 STDOUT terraform1.11.0:   + create
09:59:00.371 STDOUT terraform1.11.0:   ~ update in-place
09:59:00.371 STDOUT terraform1.11.0:  <= read (data resources)
09:59:00.371 STDOUT terraform1.11.0: Terraform will perform the following actions:
09:59:00.371 STDOUT terraform1.11.0:   # data.http.casdoor_oidc_discovery[0] will be read during apply
09:59:00.371 STDOUT terraform1.11.0:   # (depends on a resource or a module with changes pending)
09:59:00.371 STDOUT terraform1.11.0:  <= data "http" "casdoor_oidc_discovery" {
09:59:00.371 STDOUT terraform1.11.0:       + body                 = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + id                   = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + request_headers      = {
09:59:00.371 STDOUT terraform1.11.0:           + "Accept" = "application/json"
09:59:00.371 STDOUT terraform1.11.0:         }
09:59:00.371 STDOUT terraform1.11.0:       + response_body        = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + response_body_base64 = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + response_headers     = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + status_code          = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
09:59:00.371 STDOUT terraform1.11.0:     }
09:59:00.371 STDOUT terraform1.11.0:   # data.http.portal_auth_ping[0] will be read during apply
09:59:00.371 STDOUT terraform1.11.0:   # (depends on a resource or a module with changes pending)
09:59:00.371 STDOUT terraform1.11.0:  <= data "http" "portal_auth_ping" {
09:59:00.371 STDOUT terraform1.11.0:       + body                 = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + id                   = (known after apply)
09:59:00.371 STDOUT terraform1.11.0:       + response_body        = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + response_body_base64 = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + response_headers     = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + status_code          = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + url                  = "https://auth.zitian.party/ping"
09:59:00.372 STDOUT terraform1.11.0:     }
09:59:00.372 STDOUT terraform1.11.0:   # data.vault_kv_secret_v2.kubero will be read during apply
09:59:00.372 STDOUT terraform1.11.0:   # (depends on a resource or a module with changes pending)
09:59:00.372 STDOUT terraform1.11.0:  <= data "vault_kv_secret_v2" "kubero" {
09:59:00.372 STDOUT terraform1.11.0:       + created_time    = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + custom_metadata = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + data            = (sensitive value)
09:59:00.372 STDOUT terraform1.11.0:       + data_json       = (sensitive value)
09:59:00.372 STDOUT terraform1.11.0:       + deletion_time   = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + destroyed       = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + id              = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:       + mount           = "secret"
09:59:00.372 STDOUT terraform1.11.0:       + name            = "kubero"
09:59:00.372 STDOUT terraform1.11.0:       + path            = (known after apply)
09:59:00.372 STDOUT terraform1.11.0:     }
09:59:00.372 STDOUT terraform1.11.0:   # helm_release.casdoor[0] will be updated in-place
09:59:00.372 STDOUT terraform1.11.0:   ~ resource "helm_release" "casdoor" {
09:59:00.372 STDOUT terraform1.11.0:         id                         = "casdoor"
09:59:00.372 STDOUT terraform1.11.0:       ~ metadata                   = [
09:59:00.373 STDOUT terraform1.11.0:           - {
09:59:00.373 STDOUT terraform1.11.0:               - app_version    = "v1.570.0"
09:59:00.373 STDOUT terraform1.11.0:               - chart          = "casdoor-helm-charts"
09:59:00.373 STDOUT terraform1.11.0:               - first_deployed = 1765809062
09:59:00.373 STDOUT terraform1.11.0:               - last_deployed  = 1765809062
09:59:00.373 STDOUT terraform1.11.0:               - name           = "casdoor"
09:59:00.373 STDOUT terraform1.11.0:               - namespace      = "platform"
09:59:00.373 STDOUT terraform1.11.0:               - notes          = <<-EOT
09:59:00.373 STDOUT terraform1.11.0:                     1. Get the application URL by running these commands:
09:59:00.373 STDOUT terraform1.11.0:                       https://sso.zitian.party/
09:59:00.373 STDOUT terraform1.11.0:                 EOT
09:59:00.373 STDOUT terraform1.11.0:               - revision       = 1
09:59:00.373 STDOUT terraform1.11.0:               - values         = jsonencode(
09:59:00.373 STDOUT terraform1.11.0:                     {
09:59:00.373 STDOUT terraform1.11.0:                       - config            = <<-EOT
09:59:00.373 STDOUT terraform1.11.0:                             appname = casdoor
09:59:00.373 STDOUT terraform1.11.0:                             httpport = 8000
09:59:00.373 STDOUT terraform1.11.0:                             origin = https://sso.zitian.party
09:59:00.373 STDOUT terraform1.11.0:                             staticBaseUrl = https://cdn.casbin.org
09:59:00.373 STDOUT terraform1.11.0:                             
09:59:00.373 STDOUT terraform1.11.0:                             # Required for Beego to parse request body (fixes "unexpected end of JSON input" login bug)
09:59:00.373 STDOUT terraform1.11.0:                             # Reference: https://github.com/casdoor/casdoor/issues/3224
09:59:00.373 STDOUT terraform1.11.0:                             copyrequestbody = true
09:59:00.373 STDOUT terraform1.11.0:                             
09:59:00.373 STDOUT terraform1.11.0:                             # Database configuration
09:59:00.373 STDOUT terraform1.11.0:                             driverName = postgres
09:59:00.373 STDOUT terraform1.11.0:                             dataSourceName = user=postgres password=Ld63FK25alvAwewa18YS85JMPwxzkt host=postgresql.platform.svc.cluster.local port=5432 dbname=casdoor sslmode=disable
09:59:00.374 STDOUT terraform1.11.0:                             dbName = casdoor
09:59:00.374 STDOUT terraform1.11.0:                         EOT
09:59:00.374 STDOUT terraform1.11.0:                       - extraVolumeMounts = [
09:59:00.374 STDOUT terraform1.11.0:                           - {
09:59:00.374 STDOUT terraform1.11.0:                               - mountPath = "/init_data.json"
09:59:00.374 STDOUT terraform1.11.0:                               - name      = "init-data"
09:59:00.374 STDOUT terraform1.11.0:                               - readOnly  = true
09:59:00.374 STDOUT terraform1.11.0:                               - subPath   = "init_data.json"
09:59:00.374 STDOUT terraform1.11.0:                             },
09:59:00.374 STDOUT terraform1.11.0:                         ]
09:59:00.374 STDOUT terraform1.11.0:                       - extraVolumes      = [
09:59:00.374 STDOUT terraform1.11.0:                           - {
09:59:00.374 STDOUT terraform1.11.0:                               - configMap = {
09:59:00.374 STDOUT terraform1.11.0:                                   - name = "casdoor-init-data"
09:59:00.374 STDOUT terraform1.11.0:                                 }
09:59:00.374 STDOUT terraform1.11.0:                               - name      = "init-data"
09:59:00.374 STDOUT terraform1.11.0:                             },
09:59:00.374 STDOUT terraform1.11.0:                         ]
09:59:00.374 STDOUT terraform1.11.0:                       - image             = {
09:59:00.374 STDOUT terraform1.11.0:                           - name       = "casdoor"
09:59:00.374 STDOUT terraform1.11.0:                           - pullPolicy = "IfNotPresent"
09:59:00.374 STDOUT terraform1.11.0:                           - repository = "casbin"
09:59:00.374 STDOUT terraform1.11.0:                           - tag        = "v1.570.0"
09:59:00.374 STDOUT terraform1.11.0:                         }
09:59:00.374 STDOUT terraform1.11.0:                       - ingress           = {
09:59:00.374 STDOUT terraform1.11.0:                           - annotations = {
09:59:00.374 STDOUT terraform1.11.0:                               - "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
09:59:00.374 STDOUT terraform1.11.0:                             }
09:59:00.374 STDOUT terraform1.11.0:                           - className   = "traefik"
09:59:00.374 STDOUT terraform1.11.0:                           - enabled     = true
09:59:00.374 STDOUT terraform1.11.0:                           - hosts       = [
09:59:00.374 STDOUT terraform1.11.0:                               - {
09:59:00.374 STDOUT terraform1.11.0:                                   - host  = "sso.zitian.party"
09:59:00.375 STDOUT terraform1.11.0:                                   - paths = [
09:59:00.375 STDOUT terraform1.11.0:                                       - {
09:59:00.375 STDOUT terraform1.11.0:                                           - path     = "/"
09:59:00.375 STDOUT terraform1.11.0:                                           - pathType = "Prefix"
09:59:00.375 STDOUT terraform1.11.0:                                         },
09:59:00.375 STDOUT terraform1.11.0:                                     ]
09:59:00.375 STDOUT terraform1.11.0:                                 },
09:59:00.375 STDOUT terraform1.11.0:                             ]
09:59:00.375 STDOUT terraform1.11.0:                           - tls         = [
09:59:00.375 STDOUT terraform1.11.0:                               - {
09:59:00.375 STDOUT terraform1.11.0:                                   - hosts      = [
09:59:00.375 STDOUT terraform1.11.0:                                       - "sso.zitian.party",
09:59:00.375 STDOUT terraform1.11.0:                                     ]
09:59:00.375 STDOUT terraform1.11.0:                                   - secretName = "casdoor-tls"
09:59:00.375 STDOUT terraform1.11.0:                                 },
09:59:00.375 STDOUT terraform1.11.0:                             ]
09:59:00.375 STDOUT terraform1.11.0:                         }
09:59:00.375 STDOUT terraform1.11.0:                       - initContainers    = [
09:59:00.375 STDOUT terraform1.11.0:                           - {
09:59:00.375 STDOUT terraform1.11.0:                               - command = [
09:59:00.375 STDOUT terraform1.11.0:                                   - "sh",
09:59:00.375 STDOUT terraform1.11.0:                                   - "-c",
09:59:00.375 STDOUT terraform1.11.0:                                   - "timeout=120; elapsed=0; until nc -z postgresql.platform.svc.cluster.local 5432; do echo \"waiting for PostgreSQL... ($elapsed/$timeout s)\"; sleep 2; elapsed=$((elapsed+2)); if [ $elapsed -ge $timeout ]; then echo 'TIMEOUT: PostgreSQL not available'; exit 1; fi; done",
09:59:00.375 STDOUT terraform1.11.0:                                 ]
09:59:00.375 STDOUT terraform1.11.0:                               - image   = "busybox:1.36"
09:59:00.375 STDOUT terraform1.11.0:                               - name    = "wait-for-postgres"
09:59:00.376 STDOUT terraform1.11.0:                             },
09:59:00.376 STDOUT terraform1.11.0:                         ]
09:59:00.376 STDOUT terraform1.11.0:                       - livenessProbe     = {
09:59:00.376 STDOUT terraform1.11.0:                           - failureThreshold = 3
09:59:00.376 STDOUT terraform1.11.0:                           - httpGet          = {
09:59:00.376 STDOUT terraform1.11.0:                               - path = "/"
09:59:00.376 STDOUT terraform1.11.0:                               - port = "http"
09:59:00.376 STDOUT terraform1.11.0:                             }
09:59:00.376 STDOUT terraform1.11.0:                           - periodSeconds    = 10
09:59:00.376 STDOUT terraform1.11.0:                         }
09:59:00.376 STDOUT terraform1.11.0:                       - readinessProbe    = {
09:59:00.376 STDOUT terraform1.11.0:                           - failureThreshold = 3
09:59:00.376 STDOUT terraform1.11.0:                           - httpGet          = {
09:59:00.376 STDOUT terraform1.11.0:                               - path = "/"
09:59:00.376 STDOUT terraform1.11.0:                               - port = "http"
09:59:00.376 STDOUT terraform1.11.0:                             }
09:59:00.376 STDOUT terraform1.11.0:                           - periodSeconds    = 10
09:59:00.376 STDOUT terraform1.11.0:                         }
09:59:00.376 STDOUT terraform1.11.0:                       - replicaCount      = 1
09:59:00.376 STDOUT terraform1.11.0:                       - resources         = {
09:59:00.376 STDOUT terraform1.11.0:                           - limits   = {
09:59:00.376 STDOUT terraform1.11.0:                               - cpu    = "500m"
09:59:00.376 STDOUT terraform1.11.0:                               - memory = "512Mi"
09:59:00.376 STDOUT terraform1.11.0:                             }
09:59:00.376 STDOUT terraform1.11.0:                           - requests = {
09:59:00.376 STDOUT terraform1.11.0:                               - cpu    = "100m"
09:59:00.376 STDOUT terraform1.11.0:                               - memory = "128Mi"
09:59:00.377 STDOUT terraform1.11.0:                             }
09:59:00.377 STDOUT terraform1.11.0:                         }
09:59:00.377 STDOUT terraform1.11.0:                       - service           = {
09:59:00.377 STDOUT terraform1.11.0:                           - port = 8000
09:59:00.377 STDOUT terraform1.11.0:                           - type = "ClusterIP"
09:59:00.377 STDOUT terraform1.11.0:                         }
09:59:00.377 STDOUT terraform1.11.0:                       - startupProbe      = {
09:59:00.377 STDOUT terraform1.11.0:                           - failureThreshold = 12
09:59:00.377 STDOUT terraform1.11.0:                           - httpGet          = {
09:59:00.377 STDOUT terraform1.11.0:                               - path = "/"
09:59:00.377 STDOUT terraform1.11.0:                               - port = "http"
09:59:00.377 STDOUT terraform1.11.0:                             }
09:59:00.377 STDOUT terraform1.11.0:                           - periodSeconds    = 10
09:59:00.377 STDOUT terraform1.11.0:                         }
09:59:00.377 STDOUT terraform1.11.0:                     }
09:59:00.377 STDOUT terraform1.11.0:                 )
09:59:00.377 STDOUT terraform1.11.0:               - version        = "v1.570.0"
09:59:00.377 STDOUT terraform1.11.0:             },
09:59:00.377 STDOUT terraform1.11.0:         ] -> (known after apply)
09:59:00.377 STDOUT terraform1.11.0:         name                       = "casdoor"
09:59:00.377 STDOUT terraform1.11.0:       ~ values                     = [
09:59:00.377 STDOUT terraform1.11.0:           ~ (sensitive value),
09:59:00.377 STDOUT terraform1.11.0:         ]
09:59:00.377 STDOUT terraform1.11.0:         # (26 unchanged attributes hidden)
09:59:00.377 STDOUT terraform1.11.0:     }
09:59:00.377 STDOUT terraform1.11.0:   # helm_release.vault will be updated in-place
09:59:00.377 STDOUT terraform1.11.0:   ~ resource "helm_release" "vault" {
09:59:00.377 STDOUT terraform1.11.0:         id                         = "vault"
09:59:00.377 STDOUT terraform1.11.0:       ~ metadata                   = [
09:59:00.377 STDOUT terraform1.11.0:           - {
09:59:00.377 STDOUT terraform1.11.0:               - app_version    = "1.20.4"
09:59:00.377 STDOUT terraform1.11.0:               - chart          = "vault"
09:59:00.377 STDOUT terraform1.11.0:               - first_deployed = 1765809061
09:59:00.377 STDOUT terraform1.11.0:               - last_deployed  = 1765809061
09:59:00.377 STDOUT terraform1.11.0:               - name           = "vault"
09:59:00.377 STDOUT terraform1.11.0:               - namespace      = "platform"
09:59:00.377 STDOUT terraform1.11.0:               - notes          = <<-EOT
09:59:00.377 STDOUT terraform1.11.0:                     Thank you for installing HashiCorp Vault!
09:59:00.377 STDOUT terraform1.11.0:                     
09:59:00.378 STDOUT terraform1.11.0:                     Now that you have deployed Vault, you should look over the docs on using
09:59:00.378 STDOUT terraform1.11.0:                     Vault with Kubernetes available here:
09:59:00.378 STDOUT terraform1.11.0:                     
09:59:00.378 STDOUT terraform1.11.0:                     https://developer.hashicorp.com/vault/docs
09:59:00.378 STDOUT terraform1.11.0:                     
09:59:00.378 STDOUT terraform1.11.0:                     
09:59:00.378 STDOUT terraform1.11.0:                     Your release is named vault. To learn more about the release, try:
09:59:00.378 STDOUT terraform1.11.0:                     
09:59:00.378 STDOUT terraform1.11.0:                       $ helm status vault
09:59:00.378 STDOUT terraform1.11.0:                       $ helm get manifest vault
09:59:00.378 STDOUT terraform1.11.0:                 EOT
09:59:00.378 STDOUT terraform1.11.0:               - revision       = 1
09:59:00.378 STDOUT terraform1.11.0:               - values         = jsonencode(
09:59:00.378 STDOUT terraform1.11.0:                     {
09:59:00.378 STDOUT terraform1.11.0:                       - global   = {
09:59:00.378 STDOUT terraform1.11.0:                           - tlsDisable = true
09:59:00.378 STDOUT terraform1.11.0:                         }
09:59:00.378 STDOUT terraform1.11.0:                       - injector = {
09:59:00.378 STDOUT terraform1.11.0:                           - enabled = true
09:59:00.378 STDOUT terraform1.11.0:                         }
09:59:00.378 STDOUT terraform1.11.0:                       - server   = {
09:59:00.378 STDOUT terraform1.11.0:                           - auditStorage        = {
09:59:00.378 STDOUT terraform1.11.0:                               - enabled      = true
09:59:00.378 STDOUT terraform1.11.0:                               - size         = "1Gi"
09:59:00.378 STDOUT terraform1.11.0:                               - storageClass = "local-path-retain"
09:59:00.378 STDOUT terraform1.11.0:                             }
09:59:00.378 STDOUT terraform1.11.0:                           - dataStorage         = {
09:59:00.378 STDOUT terraform1.11.0:                               - enabled = false
09:59:00.378 STDOUT terraform1.11.0:                             }
09:59:00.378 STDOUT terraform1.11.0:                           - extraInitContainers = [
09:59:00.378 STDOUT terraform1.11.0:                               - {
09:59:00.378 STDOUT terraform1.11.0:                                   - command = [
09:59:00.378 STDOUT terraform1.11.0:                                       - "sh",
09:59:00.379 STDOUT terraform1.11.0:                                       - "-c",
09:59:00.379 STDOUT terraform1.11.0:                                       - "timeout=120; elapsed=0; until nc -z postgresql.platform.svc.cluster.local 5432; do echo \"waiting for PostgreSQL... ($elapsed/$timeout s)\"; sleep 2; elapsed=$((elapsed+2)); if [ $elapsed -ge $timeout ]; then echo 'TIMEOUT: PostgreSQL not available'; exit 1; fi; done",
09:59:00.379 STDOUT terraform1.11.0:                                     ]
09:59:00.379 STDOUT terraform1.11.0:                                   - image   = "busybox:1.36"
09:59:00.379 STDOUT terraform1.11.0:                                   - name    = "wait-for-postgres"
09:59:00.379 STDOUT terraform1.11.0:                                 },
09:59:00.379 STDOUT terraform1.11.0:                             ]
09:59:00.379 STDOUT terraform1.11.0:                           - ha                  = {
09:59:00.379 STDOUT terraform1.11.0:                               - config   = <<-EOT
09:59:00.379 STDOUT terraform1.11.0:                                     ui = true
09:59:00.379 STDOUT terraform1.11.0:                                     
09:59:00.379 STDOUT terraform1.11.0:                                     listener "tcp" {
09:59:00.379 STDOUT terraform1.11.0:                                       address     = "0.0.0.0:8200"
09:59:00.379 STDOUT terraform1.11.0:                                       tls_disable = "true"
09:59:00.379 STDOUT terraform1.11.0:                                     }
09:59:00.379 STDOUT terraform1.11.0:                                     
09:59:00.379 STDOUT terraform1.11.0:                                     storage "postgresql" {
09:59:00.379 STDOUT terraform1.11.0:                                       connection_url = "postgres://postgres:Ld63FK25alvAwewa18YS85JMPwxzkt@postgresql.platform.svc.cluster.local:5432/vault?sslmode=disable"
09:59:00.379 STDOUT terraform1.11.0:                                       table          = "vault_kv_store"
09:59:00.379 STDOUT terraform1.11.0:                                       ha_enabled     = true
09:59:00.379 STDOUT terraform1.11.0:                                       ha_table       = "vault_ha_locks"
09:59:00.379 STDOUT terraform1.11.0:                                     }
09:59:00.379 STDOUT terraform1.11.0:                                     
09:59:00.379 STDOUT terraform1.11.0:                                     service_registration "kubernetes" {}
09:59:00.379 STDOUT terraform1.11.0:                                 EOT
09:59:00.379 STDOUT terraform1.11.0:                               - enabled  = true
09:59:00.380 STDOUT terraform1.11.0:                               - raft     = {
09:59:00.380 STDOUT terraform1.11.0:                                   - enabled = false
09:59:00.380 STDOUT terraform1.11.0:                                 }
09:59:00.380 STDOUT terraform1.11.0:                               - replicas = 1
09:59:00.380 STDOUT terraform1.11.0:                             }
09:59:00.380 STDOUT terraform1.11.0:                           - image               = {
09:59:00.380 STDOUT terraform1.11.0:                               - repository = "hashicorp/vault"
09:59:00.380 STDOUT terraform1.11.0:                               - tag        = "1.20.4"
09:59:00.380 STDOUT terraform1.11.0:                             }
09:59:00.380 STDOUT terraform1.11.0:                           - livenessProbe       = {
09:59:00.380 STDOUT terraform1.11.0:                               - enabled             = true
09:59:00.380 STDOUT terraform1.11.0:                               - initialDelaySeconds = 60
09:59:00.380 STDOUT terraform1.11.0:                               - path                = "/v1/sys/health?standbyok=true"
09:59:00.380 STDOUT terraform1.11.0:                             }
09:59:00.380 STDOUT terraform1.11.0:                           - readinessProbe      = {
09:59:00.380 STDOUT terraform1.11.0:                               - enabled = true
09:59:00.380 STDOUT terraform1.11.0:                               - path    = "/v1/sys/health?standbyok=true&sealedcode=204&uninitcode=204"
09:59:00.380 STDOUT terraform1.11.0:                             }
09:59:00.380 STDOUT terraform1.11.0:                           - service             = {
09:59:00.380 STDOUT terraform1.11.0:                               - type = "ClusterIP"
09:59:00.380 STDOUT terraform1.11.0:                             }
09:59:00.380 STDOUT terraform1.11.0:                         }
09:59:00.380 STDOUT terraform1.11.0:                     }
09:59:00.380 STDOUT terraform1.11.0:                 )
09:59:00.380 STDOUT terraform1.11.0:               - version        = "0.31.0"
09:59:00.380 STDOUT terraform1.11.0:             },
09:59:00.380 STDOUT terraform1.11.0:         ] -> (known after apply)
09:59:00.380 STDOUT terraform1.11.0:         name                       = "vault"
09:59:00.380 STDOUT terraform1.11.0:       ~ values                     = [
09:59:00.380 STDOUT terraform1.11.0:           ~ (sensitive value),
09:59:00.381 STDOUT terraform1.11.0:         ]
09:59:00.381 STDOUT terraform1.11.0:         # (26 unchanged attributes hidden)
09:59:00.381 STDOUT terraform1.11.0:     }
09:59:00.381 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_instance will be updated in-place
09:59:00.381 STDOUT terraform1.11.0:   ~ resource "kubectl_manifest" "kubero_instance" {
09:59:00.381 STDOUT terraform1.11.0:         id                      = "/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero"
09:59:00.381 STDOUT terraform1.11.0:         name                    = "kubero"
09:59:00.381 STDOUT terraform1.11.0:       ~ yaml_body               = (sensitive value)
09:59:00.381 STDOUT terraform1.11.0:       ~ yaml_body_parsed        = <<-EOT
09:59:00.381 STDOUT terraform1.11.0:             apiVersion: application.kubero.dev/v1alpha1
09:59:00.381 STDOUT terraform1.11.0:             kind: Kubero
09:59:00.381 STDOUT terraform1.11.0:             metadata:
09:59:00.381 STDOUT terraform1.11.0:               annotations:
09:59:00.381 STDOUT terraform1.11.0:                 vault.hashicorp.com/agent-inject: "true"
09:59:00.381 STDOUT terraform1.11.0:                 vault.hashicorp.com/agent-inject-secret-env: secret/data/data/kubero
09:59:00.381 STDOUT terraform1.11.0:                 vault.hashicorp.com/agent-inject-template-env: |
09:59:00.381 STDOUT terraform1.11.0:                   {{- with secret "secret/data/data/kubero" -}}
09:59:00.381 STDOUT terraform1.11.0:                   export KUBERO_WEBHOOK_SECRET="{{ .Data.data.KUBERO_WEBHOOK_SECRET }}"
09:59:00.381 STDOUT terraform1.11.0:                   export KUBERO_SESSION_KEY="{{ .Data.data.KUBERO_SESSION_KEY }}"
09:59:00.381 STDOUT terraform1.11.0:                   {{- end -}}
09:59:00.381 STDOUT terraform1.11.0:                 vault.hashicorp.com/role: kubero
09:59:00.381 STDOUT terraform1.11.0:               name: kubero
09:59:00.381 STDOUT terraform1.11.0:               namespace: kubero
09:59:00.381 STDOUT terraform1.11.0:             spec:
09:59:00.381 STDOUT terraform1.11.0:               image:
09:59:00.381 STDOUT terraform1.11.0:                 pullPolicy: IfNotPresent
09:59:00.381 STDOUT terraform1.11.0:                 repository: ghcr.io/kubero-dev/kubero/kubero
09:59:00.381 STDOUT terraform1.11.0:                 tag: latest
09:59:00.381 STDOUT terraform1.11.0:               ingress:
09:59:00.381 STDOUT terraform1.11.0:                 annotations:
09:59:00.381 STDOUT terraform1.11.0:                   cert-manager.io/cluster-issuer: letsencrypt-prod
09:59:00.381 STDOUT terraform1.11.0:                 className: traefik
09:59:00.381 STDOUT terraform1.11.0:                 enabled: true
09:59:00.381 STDOUT terraform1.11.0:                 hosts:
09:59:00.381 STDOUT terraform1.11.0:                 - host: kcloud.zitian.party
09:59:00.381 STDOUT terraform1.11.0:                   paths:
09:59:00.381 STDOUT terraform1.11.0:                   - path: /
09:59:00.381 STDOUT terraform1.11.0:                     pathType: Prefix
09:59:00.381 STDOUT terraform1.11.0:                 tls:
09:59:00.381 STDOUT terraform1.11.0:                 - hosts:
09:59:00.381 STDOUT terraform1.11.0:                   - kcloud.zitian.party
09:59:00.381 STDOUT terraform1.11.0:                   secretName: kubero-ui-tls
09:59:00.381 STDOUT terraform1.11.0:               kubero:
09:59:00.381 STDOUT terraform1.11.0:                 auth:
09:59:00.381 STDOUT terraform1.11.0:                   github:
09:59:00.382 STDOUT terraform1.11.0:                     enabled: false
09:59:00.382 STDOUT terraform1.11.0:                   oauth2:
09:59:00.382 STDOUT terraform1.11.0:                     authUrl: https://sso.zitian.party/login/oauth/authorize
09:59:00.382 STDOUT terraform1.11.0:                     callbackUrl: https://kcloud.zitian.party/auth/callback
09:59:00.382 STDOUT terraform1.11.0:                     enabled: "true"
09:59:00.382 STDOUT terraform1.11.0:                     id: kubero-oidc
09:59:00.382 STDOUT terraform1.11.0:                     name: Casdoor
09:59:00.382 STDOUT terraform1.11.0:                     scopes: openid profile email
09:59:00.382 STDOUT terraform1.11.0:                     secret: wrw2VpsowrotzJhSCTLawY0ovxJIsVWB
09:59:00.382 STDOUT terraform1.11.0:                     tokenUrl: https://sso.zitian.party/api/login/oauth/access_token
09:59:00.382 STDOUT terraform1.11.0:                 config:
09:59:00.382 STDOUT terraform1.11.0:                   clusterissuer: letsencrypt-prod
09:59:00.382 STDOUT terraform1.11.0:                   kubero:
09:59:00.382 STDOUT terraform1.11.0:                     admin:
09:59:00.382 STDOUT terraform1.11.0:                       disabled: false
09:59:00.382 STDOUT terraform1.11.0:                     readonly: false
09:59:00.382 STDOUT terraform1.11.0:                 context: inClusterContext
09:59:00.382 STDOUT terraform1.11.0:                 database:
09:59:00.382 STDOUT terraform1.11.0:                   accessModes:
09:59:00.382 STDOUT terraform1.11.0:                   - ReadWriteOnce
09:59:00.382 STDOUT terraform1.11.0:                   size: 1Gi
09:59:00.382 STDOUT terraform1.11.0:                   storageClassName: local-path
09:59:00.382 STDOUT terraform1.11.0:                 namespace: kubero
09:59:00.382 STDOUT terraform1.11.0:                 sessionKey: cdec8218752f037eda9a6f04ea105abf1c3593e4fbdc6bfcde7863563f0084a7
09:59:00.382 STDOUT terraform1.11.0:               livenessProbe:
09:59:00.382 STDOUT terraform1.11.0:                 httpGet:
09:59:00.382 STDOUT terraform1.11.0:                   path: /
09:59:00.382 STDOUT terraform1.11.0:                   port: 2000
09:59:00.382 STDOUT terraform1.11.0:                 initialDelaySeconds: 30
09:59:00.382 STDOUT terraform1.11.0:                 periodSeconds: 10
09:59:00.382 STDOUT terraform1.11.0:               readinessProbe:
09:59:00.382 STDOUT terraform1.11.0:                 httpGet:
09:59:00.382 STDOUT terraform1.11.0:                   path: /
09:59:00.382 STDOUT terraform1.11.0:                   port: 2000
09:59:00.382 STDOUT terraform1.11.0:                 initialDelaySeconds: 5
09:59:00.382 STDOUT terraform1.11.0:                 periodSeconds: 5
09:59:00.382 STDOUT terraform1.11.0:               replicaCount: 1
09:59:00.382 STDOUT terraform1.11.0:               service:
09:59:00.382 STDOUT terraform1.11.0:                 port: 2000
09:59:00.382 STDOUT terraform1.11.0:                 type: ClusterIP
09:59:00.382 STDOUT terraform1.11.0:         EOT -> (known after apply)
09:59:00.382 STDOUT terraform1.11.0:       ~ yaml_incluster          = (sensitive value)
09:59:00.382 STDOUT terraform1.11.0:         # (13 unchanged attributes hidden)
09:59:00.382 STDOUT terraform1.11.0:     }
09:59:00.382 STDOUT terraform1.11.0:   # kubernetes_secret.kubero_secrets will be updated in-place
09:59:00.382 STDOUT terraform1.11.0:   ~ resource "kubernetes_secret" "kubero_secrets" {
09:59:00.382 STDOUT terraform1.11.0:       ~ data                           = (sensitive value)
09:59:00.382 STDOUT terraform1.11.0:         id                             = "kubero/kubero-secrets"
09:59:00.383 STDOUT terraform1.11.0:         # (5 unchanged attributes hidden)
09:59:00.383 STDOUT terraform1.11.0:         # (1 unchanged block hidden)
09:59:00.383 STDOUT terraform1.11.0:     }
09:59:00.383 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_builtin[0] will be created
09:59:00.383 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_builtin" {
09:59:00.383 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
09:59:00.383 STDOUT terraform1.11.0:       + id             = (known after apply)
09:59:00.383 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
09:59:00.383 STDOUT terraform1.11.0:       + name           = "built-in/vault-admin"
09:59:00.383 STDOUT terraform1.11.0:     }
09:59:00.383 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_namespaced[0] will be created
09:59:00.383 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_namespaced" {
09:59:00.383 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
09:59:00.383 STDOUT terraform1.11.0:       + id             = (known after apply)
09:59:00.383 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
09:59:00.383 STDOUT terraform1.11.0:       + name           = "admin/vault-admin"
09:59:00.383 STDOUT terraform1.11.0:     }
09:59:00.383 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_namespaced[0] will be created
09:59:00.383 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_namespaced" {
09:59:00.383 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
09:59:00.383 STDOUT terraform1.11.0:       + id             = (known after apply)
09:59:00.383 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
09:59:00.383 STDOUT terraform1.11.0:       + name           = "admin/vault-developer"
09:59:00.383 STDOUT terraform1.11.0:     }
09:59:00.383 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_simple[0] will be created
09:59:00.383 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_simple" {
09:59:00.383 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
09:59:00.383 STDOUT terraform1.11.0:       + id             = (known after apply)
09:59:00.383 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
09:59:00.384 STDOUT terraform1.11.0:       + name           = "vault-developer"
09:59:00.384 STDOUT terraform1.11.0:     }
09:59:00.384 STDOUT terraform1.11.0:   # vault_identity_group_alias.viewer_simple[0] will be created
09:59:00.384 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "viewer_simple" {
09:59:00.384 STDOUT terraform1.11.0:       + canonical_id   = "89e06fbb-fc87-9471-ecc7-04b5747e4b06"
09:59:00.384 STDOUT terraform1.11.0:       + id             = (known after apply)
09:59:00.384 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
09:59:00.384 STDOUT terraform1.11.0:       + name           = "vault-viewer"
09:59:00.384 STDOUT terraform1.11.0:     }
09:59:00.384 STDOUT terraform1.11.0: Plan: 5 to add, 4 to change, 0 to destroy.
09:59:00.384 STDOUT terraform1.11.0: 
09:59:00.384 STDOUT terraform1.11.0: Changes to Outputs:
09:59:00.384 STDOUT terraform1.11.0:   ~ kubero_session_secret          = (sensitive value)
09:59:00.384 STDOUT terraform1.11.0:   ~ sso_e2e_status                 = {
09:59:00.384 STDOUT terraform1.11.0:       ~ oidc_discovery = "200" -> (known after apply)
09:59:00.384 STDOUT terraform1.11.0:       ~ portal_auth    = "200" -> (known after apply)
09:59:00.384 STDOUT terraform1.11.0:         # (1 unchanged attribute hidden)
09:59:00.384 STDOUT terraform1.11.0:     }
09:59:00.384 STDOUT terraform1.11.0: 
09:59:00.384 STDOUT terraform1.11.0: ─────────────────────────────────────────────────────────────────────────────
09:59:00.384 STDOUT terraform1.11.0: Saved the plan to:
09:59:00.384 STDOUT terraform1.11.0: ./platform-default.tfplan
09:59:00.384 STDOUT terraform1.11.0: To perform exactly these actions, run the following command to apply:
09:59:00.384 STDOUT terraform1.11.0:     terraform apply "./platform-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p platform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252Fplatform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p platform
  ```
Plan: 5 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```